{
  "environment": {
    "count": 26,
    "organizations": [
      "Ministry of Earth Sciences",
      "National Critical Information Infrastructure Protection Center (NCIIPC)",
      "Ministry of Electronics and Information Technology",
      "Ministry of Coal",
      "Ministry of Power",
      "Ministry of Communication",
      "Ministry of Jal Shakti",
      "Ministry of Law and Justice",
      "MathWorks India Private Limited",
      "Godrej Appliances",
      "Indian Space Research Organization (ISRO)",
      "Government of NCT of Delhi",
      "National Technical Research Organisation (NTRO)"
    ],
    "sample_problems": [
      "Innovating for Sustainability: Driving Smart Resource Conservation (Energy & Water) in Home Appliances (Refrigerators, Air Conditioners, Washing Machines and Desert Air Coolers)×Problem Statement DetailsProblem Statement ID1524Problem Statement TitleInnovating for Sustainability: Driving Smart Resource Conservation (Energy & Water) in Home Appliances (Refrigerators, Air Conditioners, Washing Machines and Desert Air Coolers)DescriptionInnovating for Sustainability: Driving Smart Resource Conservation (Energy & Water) in Home Appliances (Refrigerators, Air Conditioners, Washing Machines and Desert Air Coolers)OrganizationGodrej AppliancesDepartmentGodrej AppliancesCategoryHardwareThemeSmart Resource ConservationYoutube LinkDataset LinkContact info",
      "Innovating for Sustainability: Driving Smart Resource Conservation (Energy & Water) in Home Appliances (Refrigerators, Air Conditioners, Washing Machines and Desert Air Coolers)×Problem Statement DetailsProblem Statement ID1525Problem Statement TitleInnovating for Sustainability: Driving Smart Resource Conservation (Energy & Water) in Home Appliances (Refrigerators, Air Conditioners, Washing Machines and Desert Air Coolers)DescriptionInnovating for Sustainability: Driving Smart Resource Conservation (Energy & Water) in Home Appliances (Refrigerators, Air Conditioners, Washing Machines and Desert Air Coolers)OrganizationGodrej AppliancesDepartmentGodrej AppliancesCategorySoftwareThemeSmart Resource ConservationYoutube LinkDataset LinkContact info",
      "Sustainable Utilization of 100% of Ash from Coal based Thermal Power Plants.×Problem Statement DetailsProblem Statement ID1573Problem Statement TitleSustainable Utilization of 100% of Ash from Coal based Thermal Power Plants.DescriptionBackground:\nThermal power plants, that burn coal, produce a substantial amount of ash, including fly ash and bottom ash, as byproducts. The disposal of this ash presents significant environmental challenges, such as land degradation, groundwater contamination, and air pollution. Traditional disposal methods like landfilling or Ash dykes are not only unsustainable but also lead to challenges in ecological restoration. Despite the potential for beneficial use in various industries, a large portion of ash remains underutilized.\n\nDescription:\nCurrent methods for managing and disposing of ash from power plants are inadequate and environmentally detrimental. The accumulation of ash in landfills poses serious environmental risks, including soil and water pollution. Additionally, these disposal methods fail to leverage the potential value of ash in other applications. There is a critical need to develop sustainable and economically viable solutions for repurposing this ash, transforming it from a waste product into a valuable resource.\n\nExpected Solutions:\nTo address the problem of ash disposal and utilization, the following solutions can be explored:\nConstruction Materials: Develop new type of material in which incorporating fly ash to enhance material properties and reduce the environmental footprint of construction activities.\nSoil Amendment and Agriculture: Investigate the use of ash as a soil conditioner to improve soil quality and support sustainable agricultural practices.\nManufacturing Processes: Utilize ash in the production of ceramics, glass, and other industrial products, capitalizing on its chemical properties.\nEnvironmental Remediation: Explore the use of ash in environmental cleanup projects, such as neutralizing acidic soils or treating wastewater.\n\nChallenges to Address:\nTechnical Feasibility: Develop processes that effectively utilize ash without compromising the quality and safety of the end products.\nEconomic Viability: Ensure that the proposed solutions are cost-effective and competitive with traditional materials and methods.\nRegulatory Compliance: Navigate the regulatory landscape to ensure that the use of ash meets all environmental and safety standards.\nMarket Acceptance: Gain acceptance from industries and consumers for products made with ash.OrganizationMinistry of PowerDepartmentMinistry of PowerCategoryHardwareThemeRenewable / Sustainable EnergyYoutube LinkDataset LinkContact info"
    ]
  },
  "education": {
    "count": 85,
    "organizations": [
      "Ministry of Railway",
      "Ministry of Power",
      "Ministry of Communication",
      "Ministry of Housing and Urban Affairs",
      "Ministry of Culture",
      "Ministry of Earth Sciences",
      "Government of Rajasthan",
      "Ministry of Jal Shakti",
      "Autodesk",
      "Government of Punjab",
      "Ministry of Law and Justice",
      "Ministry of Education",
      "Ministry of Social Justice and Empowerment",
      "Bharat Electronics Limited (BEL)",
      "Ministry of Youth Affairs & Sports",
      "Ministry of Skill Development and Entrepreneurship (MSDE)",
      "Ministry of AYUSH",
      "Indian Space Research Organization (ISRO)",
      "Government of NCT of Delhi",
      "AICTE, MIC-Student Innovation",
      "National Security Guard (NSG), MHA",
      "Ministry of Defence",
      "Government of Gujarat",
      "AICTE",
      "GAIL, Ministry of Petroleum and Natural Gas",
      "National Technical Research Organisation (NTRO)"
    ],
    "sample_problems": [
      "Student Innovation×Problem Statement DetailsProblem Statement ID1526Problem Statement TitleStudent InnovationDescriptionSmart Education, a Concept that Describes learning in digital age.it enables learner to learn more effectively, efficently, flexibly and comfortably.OrganizationAICTE, MIC-Student InnovationDepartmentMinistry of Education's Innovation Cell (MIC)CategoryHardwareThemeSmart EducationYoutube LinkDataset LinkContact info",
      "Student Innovation×Problem Statement DetailsProblem Statement ID1527Problem Statement TitleStudent InnovationDescriptionDisaster Management includes ideas related to risk mitigation and Planning before, after or Duration of Disaster.OrganizationAICTE, MIC-Student InnovationDepartmentMinistry of Education's Innovation Cell (MIC)CategoryHardwareThemeDisaster ManagementYoutube LinkDataset LinkContact info",
      "Student Innovation×Problem Statement DetailsProblem Statement ID1528Problem Statement TitleStudent InnovationDescriptionTechnology ideas in tertiary sectors like Hospitality, Financial Services, Entertainment and Retail.OrganizationAICTE, MIC-Student InnovationDepartmentMinistry of Education's Innovation Cell (MIC)CategoryHardwareThemeMiscellaneousYoutube LinkDataset LinkContact info"
    ]
  },
  "agriculture": {
    "count": 22,
    "organizations": [
      "Department of Science and Technology",
      "Ministry of Agriculture and Farmers Welfare",
      "Ministry of Defence",
      "Ministry of Fisheries, Animal Husbandry and Dairying",
      "Ministry of Communication",
      "Ministry of Jal Shakti",
      "Ministry of Consumer Affairs, Food and Public Distribution",
      "Government of Himachal Pardesh",
      "Ministry of Panchayati Raj",
      "AICTE, MIC-Student Innovation"
    ],
    "sample_problems": [
      "Student Innovation×Problem Statement DetailsProblem Statement ID1536Problem Statement TitleStudent InnovationDescriptionDeveloping solutions, keeping in mind the need to enhance the primary sector of India - Agriculture and to manage and process our agriculture produceOrganizationAICTE, MIC-Student InnovationDepartmentMinistry of Education's Innovation Cell (MIC)CategoryHardwareThemeAgriculture, FoodTech & Rural DevelopmentYoutube LinkDataset LinkContact info",
      "Development of a suction based low-cost flush (with less water usage) for deployment in rural areas.×Problem Statement DetailsProblem Statement ID1548Problem Statement TitleDevelopment of a suction based low-cost flush (with less water usage) for deployment in rural areas.DescriptionBackground: Access to proper sanitation facilities is a significant challenge in many rural areas. Traditional flush toilets require a substantial amount of water, which may not be readily available in these regions. Additionally, the cost and complexity of installing conventional plumbing systems can be prohibitive.\nDescription: A suction-based flush system offers a potential solution by reducing water usage and simplifying installation and maintenance.\nExpected Solution: The problem statement is to develop a cost-effective, suction-based flush system that can be easily deployed in rural areas. The system should minimize water usage, be simple to install and maintain, and provide a hygienic and effective means of waste disposal.OrganizationDepartment of Science and TechnologyDepartmentDepartment of Science and TechnologyCategoryHardwareThemeMiscellaneousYoutube LinkDataset LinkContact info",
      "Smart Irrigation System for Precision Farming×Problem Statement DetailsProblem Statement ID1554Problem Statement TitleSmart Irrigation System for Precision FarmingDescriptionBackground: Water scarcity is a major challenge in agriculture, leading to inefficient water use and reduced crop yields. Traditional irrigation methods often result in overuse or underuse of water.\nDescription: Develop a smart irrigation system that utilizes sensors and IoT technology to monitor soil moisture levels and weather conditions. This system will provide real-time data to farmers, enabling them to make informed decisions on irrigation scheduling, thus optimizing water usage and enhancing crop yield.\nExpected Solution: A smart irrigation module integrated with moisture sensors and a mobile application to provide farmers with timely irrigation alerts and recommendations based on real-time data.OrganizationMinistry of Agriculture and Farmers WelfareDepartmentUniversity of Agricultural Sciences, Dharwad (UASD), The Indian Council of Agricultural ResearchCategoryHardwareThemeAgriculture, FoodTech & Rural DevelopmentYoutube LinkDataset LinkContact info"
    ]
  },
  "healthcare": {
    "count": 24,
    "organizations": [
      "Ministry of Earth Sciences",
      "Department of Science and Technology",
      "National Security Guard (NSG), MHA",
      "Ministry of Coal",
      "Ministry of Social Justice and Empowerment",
      "Ministry of Skill Development and Entrepreneurship (MSDE)",
      "Ministry of Youth Affairs & Sports",
      "Ministry of Fisheries, Animal Husbandry and Dairying",
      "Ministry of AYUSH",
      "Ministry of Jal Shakti",
      "Government of NCT of Delhi",
      "Ministry of Housing and Urban Affairs",
      "AICTE, MIC-Student Innovation"
    ],
    "sample_problems": [
      "Student Innovation×Problem Statement DetailsProblem Statement ID1537Problem Statement TitleStudent InnovationDescriptionCutting-edge technology in these sectors continues to be in demand. Recent shifts in healthcare trends, growing populations also present an array of opportunities for innovation.OrganizationAICTE, MIC-Student InnovationDepartmentMinistry of Education's Innovation Cell (MIC)CategoryHardwareThemeMedTech / BioTech / HealthTechYoutube LinkDataset LinkContact info",
      "Development of an alternative technology to check blockage of blood vessels (an alternative to conventional angiography.×Problem Statement DetailsProblem Statement ID1547Problem Statement TitleDevelopment of an alternative technology to check blockage of blood vessels (an alternative to conventional angiography.DescriptionBackground: Angiography is a common medical imaging technique used to visualize the inside of blood vessels and detect blockages.\nDescription: However, typically medical tests like radionuclide angiography involve the use of radioactive contrast agents, which can pose risks to patients, including radiation exposure and allergic reactions. There is a growing need for safer, non-invasive alternatives that can provide accurate diagnostics without these risks.\nExpected Solution: The problem statement is to develop a cost-effective, non-invasive technology that can accurately detect blockages in blood vessels without the use of radioactive materials. This technology should be suitable for widespread clinical use and provide reliable results comparable to conventional angiography.OrganizationDepartment of Science and TechnologyDepartmentDepartment of Science and TechnologyCategoryHardwareThemeMedTech / BioTech / HealthTechYoutube LinkDataset LinkContact info",
      "Development of chemical strip (non-electronic) for identification of high temperature exposure in transportation of medicines/vaccines/FMCG goods, to ensure its usability.×Problem Statement DetailsProblem Statement ID1549Problem Statement TitleDevelopment of chemical strip (non-electronic) for identification of high temperature exposure in transportation of medicines/vaccines/FMCG goods, to ensure its usability.DescriptionBackground: The transportation of temperature-sensitive goods is a critical aspect of supply chain management. Medicines, vaccines, and certain FMCG products require strict temperature control to maintain their efficacy and safety.\nDescription: Exposure to high temperatures can compromise these products, leading to potential health risks and financial losses. Traditional electronic temperature monitoring devices can be costly and may not be feasible for all types of shipments. \nExpected Solution: Problem statement is to develop a cost-effective, non-electronic chemical strip that changes colour or exhibits a visible change when exposed to temperatures above a certain threshold. This strip should be easy to use, reliable, and capable of providing a clear indication of temperature breaches during transportation.OrganizationDepartment of Science and TechnologyDepartmentDepartment of Science and TechnologyCategoryHardwareThemeMedTech / BioTech / HealthTechYoutube LinkDataset LinkContact info"
    ]
  },
  "others": {
    "count": 28,
    "organizations": [
      "Department of Science and Technology",
      "Organization",
      "Ministry of Electronics and Information Technology",
      "Ministry of Defence",
      "Ministry of Coal",
      "Ministry of Social Justice and Empowerment",
      "Madhya Pradesh Police",
      "Ministry of Jal Shakti",
      "GAIL, Ministry of Petroleum and Natural Gas",
      "Indian Space Research Organization (ISRO)",
      "National Technical Research Organisation (NTRO)",
      "Ministry of Information and Broadcasting",
      "National Aluminium Company Limited (NALCO)"
    ],
    "sample_problems": [
      "Development of a non-electrical device for tracking the movement of the sun for movement of the solar panels, increasing their efficiency.×Problem Statement DetailsProblem Statement ID1545Problem Statement TitleDevelopment of a non-electrical device for tracking the movement of the sun for movement of the solar panels, increasing their efficiency.DescriptionBackground: Solar panels are most efficient when they are directly facing the sun. However, the sun├ö├ç├ûs position changes throughout the day and across seasons, which can reduce the amount of sunlight that fixed solar panels receive.\nDescription: Traditional solar tracking systems often rely on electrical components and motors, which can be costly and require maintenance. A non-electrical tracking system offers a sustainable and low-maintenance alternative to enhance the efficiency of solar panels.\nExpected Solution: The problem statement is to develop a cost-effective, non-electrical device that can accurately track the sun├ö├ç├ûs movement and adjust the orientation of solar panels to maintain optimal exposure. This device should be reliable, easy to install, and capable of operating without external power sources.OrganizationDepartment of Science and TechnologyDepartmentDepartment of Science and TechnologyCategoryHardwareThemeRenewable / Sustainable EnergyYoutube LinkDataset LinkContact info",
      "Automatic Change detection in Synthetic Aperture Radar satellite images×Problem Statement DetailsProblem Statement ID1563Problem Statement TitleAutomatic Change detection in Synthetic Aperture Radar satellite imagesDescriptionBackground: Synthetic Aperture Radar satellite images have the capability for night time imaging as well as imaging without being affected by clouds. Automatic change detection on such images have wider application for various use cases.\nDescription: Change detection between two SAR (Synthetic Aperture Radar) satellite images are straight forward if they are co-registered as the difference or ratio of corresponding pixels of the two images itself will give the change map. But such change maps will invariably have many natural changes as well like water body extent, flood extent, snow cover and forest cover changes etc. Our interest is to detect only man made changes and avoid natural changes.\nThe solution can make use of Sentinel 1 SAR Open source satellite images and Google Earth Engine platform to access them. These images are co-registered by default. The GRD (Ground Range Detected) intensity image version of the Sentinel 1 SAR is to be used. Please note that images with same viewing geometry are better suited for change detection purposes. The solution should give the option for the user to vary the thresholds if any used for filtering change results. The change output should be in the form of polygons in a geographically referenced vector file. The solution should be scalable, means should be able to run on huge areas of interest and generate change alerts. The criteria for winning solution would be minimum false alarms with regard to man made changes.\nExpected Solution: A software based solution is expected that has a GUI to specify the area of interest for change detection and threshold controls to filter changes and output changes in the form of shapefiles/geojson with geographical references. It shall run above Google Earth Engine.OrganizationNational Technical Research Organisation (NTRO)DepartmentNational Technical Research Organisation (NTRO)CategoryHardwareThemeSpace TechnologyYoutube LinkDataset Linkhttps://developers.google.com/earth-engine/datasets/catalog/COPRNICUS_S1_GRDContact info",
      "Automatic Road Extraction and alert generation for new roads×Problem Statement DetailsProblem Statement ID1564Problem Statement TitleAutomatic Road Extraction and alert generation for new roadsDescriptionBackground: Department of Space has made available its medium resolution satellite images through Boonidhi portal. Resourcesat satellite images (LISS IV sensor) are useful to extract roads with width of 20 feet and above due to its resolution.\nDescription Roads: are linear features on satellite images and quite clearly visible for human interpretation because of their linearity. Automated road extraction is required in view of very large volume of imagery available nowadays. The roads extracted must be saved to a GIS database. When there is a change or new road development compared to previous image of the same area, there should be an alert generated.\nExpected Solution: A software based solution is expected that has a GUI to specify the area of interest for road extraction and alerts generation. Output should be in the form of shapefiles with geographical references. It should make use of ISRO├ö├ç├ûs Boonidhi images. The alert should be sent to configured email ids.OrganizationNational Technical Research Organisation (NTRO)DepartmentNational Technical Research Organisation (NTRO)CategoryHardwareThemeSpace TechnologyYoutube LinkDataset LinkContact info"
    ]
  },
  "smart_city": {
    "count": 3,
    "organizations": [
      "Ministry of Housing and Urban Affairs",
      "Department of Science and Technology"
    ],
    "sample_problems": [
      "Development of innovative design for flushing systems in western toilet sheets which can be used for deployment in public toilets.×Problem Statement DetailsProblem Statement ID1546Problem Statement TitleDevelopment of innovative design for flushing systems in western toilet sheets which can be used for deployment in public toilets.DescriptionBackground: Public toilets are essential for maintaining hygiene in urban areas, but they often face challenges such as high usage, maintenance issues, and water wastage.\nDescription and Expected Solution: An innovative public toilet design is required so that maximum usable area gets cleans during the flushing and can be automated in a mechanized form (not electronic), so that after the usage, the flushing system gets activated automatically, and the whole usable area gets cleaned.OrganizationDepartment of Science and TechnologyDepartmentDepartment of Science and TechnologyCategoryHardwareThemeMiscellaneousYoutube LinkDataset LinkContact info",
      "Development of Portable EMI/EMC, induction measurement Instruments.×Problem Statement DetailsProblem Statement ID1585Problem Statement TitleDevelopment of Portable EMI/EMC, induction measurement Instruments.DescriptionBackground: In Metro network various electronics cards and equipment are installed which have to work nearby high voltage power supply, therefore the functioning of these cards may be affected due to the EMI/EMC generated due to above power supply. Therefore, the measurement of EMI/EMC in environment is essential requirement in metro system; however, traditional measurement instruments for these parameters are often bulky, expensive, and require specialized skills to operate so need to develop portable EMI EMC meter\nDescription: The problem statement aims to develop a series of portable meters for measuring electromagnetic interference (EMI), induction, torque, and adhesion, catering to the needs of diverse industries. These portable meters will be compact. lightweight, and user-friendly. allowing for easy deployment in various environments and applications.\nThe EMI meter will be capable of detecting and analyzing electromagnetic emissions from electronic devices, machinery, and infrastructure to assess their compliance with electromagnetic compatibility (EMC) standards. It will feature advanced signal processing algorithms to identify and quantify EMI sources accurately.\nExpected Solution: The proposed solution will involve the development of a series of portable meters for measuring EMI/EMC parameters. These meters will be designed to be compact, lightweight, and rugged, suitable for use in various industrial environments. Additionally, the meters will feature wireless connectivity options for data transmission and integration with existing systems and workflows.\nBy providing portable meters for EMI/EMC measurement, the proposed solution will enable organizations to enhance product quality, improve operational efficiency, and ensure compliance with industry standards.OrganizationMinistry of Housing and Urban AffairsDepartmentSmart Cities MissionCategoryHardwareThemeMiscellaneousYoutube LinkDataset LinkContact info",
      "Utilization of aerial/ drone-based images for monitoring of progress of construction activities for building construction projects×Problem Statement DetailsProblem Statement ID1726Problem Statement TitleUtilization of aerial/ drone-based images for monitoring of progress of construction activities for building construction projectsDescriptionBackground: The monitoring of physical progress of construction activities requires a technical expert to visit and observe the site. Due to large number of projects in Indian cities, field visits by technical experts for weekly/daily monitoring becomes non-feasible. A machine learning based solution, which can identify the status of construction activities based on images, can allow the ULBs, stage agencies, and central agencies to monitor physical progress daily, or even in real time.\r Description: The problem requires a machine learning based software solution in which aerial/drone-based images from sites of ongoing road construction projects can be processed, to identify the stage of construction.\r As the road construction activities include multiple components and stages in construction; the software can take inputs regarding (type of activity, exact road stretch (from which location to which location) etc.), to identify the type of algorithm to be used to analyze the images. \r For different components of construction activities, different machine learning algorithms will need to be developed with training using images from road construction site.\r While similar monitoring solutions are required for all types of projects, the current problem statement only includes \"road construction projects\", to keep scope of problem statement limited and assess the feasibility of similar solutions in future.\r Expected Solution: A software solution utilizing machine learning algorithm to identify stage of road construction works or progress of construction activities from uploaded site images, which should be able to:\r - Allow users to upload images and provide information regarding type of activity to be assessed (installation of utility ducts, macadamization, road construction, installment of pedestrian infrastructure, etc.)\r -Analyze the images and describe the construction activity, stage of construction, and road lengths for which different components have been completed.\r -Compare status of road construction with previous site images and provide data regarding progress of work.\r -Raise error in case of incorrect image/details have been uploaded and ask the user for necessary corrections.OrganizationMinistry of Housing and Urban AffairsDepartmentSmart Cities MissionCategorySoftwareThemeSmart AutomationYoutube LinkDataset LinkContact info"
    ]
  },
  "security": {
    "count": 29,
    "organizations": [
      "Indo-Tibetan Border Police (ITBP), MHA",
      "National Critical Information Infrastructure Protection Center (NCIIPC)",
      "Ministry of Electronics and Information Technology",
      "Ministry of Defence",
      "Madhya Pradesh Police",
      "Indian Space Research Organization (ISRO)",
      "GAIL, Ministry of Petroleum and Natural Gas",
      "Ministry of Housing and Urban Affairs",
      "Narcotics Control Bureau (NCB)",
      "National Technical Research Organisation (NTRO)",
      "National Investigation Agency (NIA)"
    ],
    "sample_problems": [
      "Develop a functional solution that demonstrates the hardware enabled root of trust.×Problem Statement DetailsProblem Statement ID1559Problem Statement TitleDevelop a functional solution that demonstrates the hardware enabled root of trust.Description1. Background. UIDAI has implemented app-based face authentication solution. This solution uses the support of the backend service to secure the captured image using PKI technology, so that it can be used by the authentication system. UIDAI intends to avoid this network call for encryption and implement an in-device solution to enable PKI implementation.\n2. Problem Description. As part of the challenge, participating teams to develop a solution that is platform agnostic i.e applicable for both Android and IOS platforms, and will derive the root of trust from the hardware of the device. The key pair so generated with the help of hardware is to identify the device uniquely and must connect it with IMEI number or any such unique number of the mobile device. The solution must meet the following requirements:-\n3. The proposed solution must meet the following objectives.\n3.1 Feature Requirement. The solution must use hardware to generate a key pair to uniquely identify the device. The private key of the certificate par must remain in the hardware and must not be extractable. All encryption must be performed within the hardware enclave (i.e in hardware) to protect the private key.\n3.2 The solution must support key lifecycle management i.e key expiry or revocation.\n3.3 The solution must be completely offline i.e. should not use any backend component for implementation of the PKI security.\n3.4 The solution must enable UIDAI to use RSA PKCS or OAEP encryption protocols.\n4. Expected Solution. The expected outcome of this project is a functionalsolution that demonstrates the PKI encryption of blob data in the mobile device using a key pair that is linked to the device hardware.OrganizationMinistry of Electronics and Information TechnologyDepartmentCo-ordination DivisionCategoryHardwareThemeSmart AutomationYoutube LinkDataset LinkContact info",
      "Solution for end-to-end tracking of dual use chemicals used in both legitimate industries and illicit drug production from point of manufacture to point of end use/export.×Problem Statement DetailsProblem Statement ID1562Problem Statement TitleSolution for end-to-end tracking of dual use chemicals used in both legitimate industries and illicit drug production from point of manufacture to point of end use/export.DescriptionBackground: Dual use precursor chemicals are substances that have legitimate industrial and commercial applications but can also be used in the illicit manufacture of drugs. For e.g. Opium is converted to Heroin using Acetic Anhydride and manufacturing of Methamphetamine is done using Ephedrine or Pseudoephedrine. Precursor chemicals are essential in various legal industries such as pharmaceuticals, agriculture, manufacturing etc., but their potential for misuse necessitates strict regulation and monitoring. Appreciating this, Government of India has put different levels of regulations on some of the precursor chemicals in India under the Regulation of Controlled Substances Order, 2013. 7 widely misused precursor chemicals are put under strictest of the controls, where in any firm dealing in any of these 7 chemicals are required to maintain records and file quarterly reports with jurisdictional NCB Zonal Unit. Any activity undertaken with respect to these chemicals like manufacture, possession, storage, sale, purchase, distribution, export, consumption etc are to be reported to NCB. Further, NCB also issues Unique Registration Number (URN) to the firms indulged in the said activities. If any individual or firm is found to be involved in any of the activities without a valid URN are punishable under the Narcotic Drugs and Controlled Substances Act, 1985.\nDescription: It is observed that some of the firms with valid URN to be handling any of the 7 domestically controlled precursor chemical, divert the same from licit channel and traffic it for manufacturing of narcotic drugs or psychotropic substances. Further, the investigations conducted also reveal that the firms usually create documentation of the movement of precursor to a licit firm for a licit activity and divert the same for illicit activities. Therefore, there is a need for end-to-end tracking of the 7 domestically controlled precursor chemicals (controlled substances)\nExpected Solution: A hardware/software/chemical solution for end-to-end tracking of dual use chemicals used in both legitimate industries and illicit drug production from point of manufacture to point of end use/exportOrganizationNarcotics Control Bureau (NCB)DepartmentNarcotics Control Bureau (NCB)CategoryHardwareThemeBlockchain & CybersecurityYoutube LinkDataset LinkContact info",
      "DDoS Protection System for Cloud: Architecture and Tool×Problem Statement DetailsProblem Statement ID1649Problem Statement TitleDDoS Protection System for Cloud: Architecture and ToolDescriptionBackground:\nMany organization are using Cloud for hosting their web applications. The attackers can try to attack these webservers for achieving Denial of Service attack. Specifically, Distributed Denial-of-Service (DDoS) attack is a malicious attempt to disrupt the normal traffic of a targeted server, service or network of Cloud infrastructure by overwhelming the target or its surrounding infrastructure with a flood of internet traffic. DDoS attacks achieve effectiveness by utilizing multiple compromised computer systems assources of attack traffic.\nExploited machines can include computers and other networked resources. Therefore, it is essential to develop appropriate security tools to counter and protect against these attacks.\n\n├ö├ç├│ Description:\nThe most obvious symptom of a DDoS attack is that a website or service suddenly becomes slow or unavailable. But since a number of causes such a legitimate spike in traffic can create similar performance issues, further\ninvestigation is usually required. Therefore, suitable analytics tools need to be developed to clearly identify an attack as DDoS.\nFollowing are some of the patterns for a DDoS attack:\n1. Suspicious amounts of traffic originating from a single IP address or IP range\n2. A flood of traffic from users who share a single behavioral profile, such as device type, geolocation, or web browser version\n3. An unexplained surge in requests to a single page or endpoint\n4. Odd traffic patterns such as spikes at odd hours of the day or patterns that appear to be unnatural (e.g. a spike every 10 minutes)\nThere are other, more specific signs of DDoS attack that can vary depending on the type of attack. The tool developer should be creative to consider other signs also.\nFor the above problem statements, following assumptions can be made:\n1. Cloud is hosting a website and providing some services to its users.\n2. The website should be always up and providing services to its users (high availability).\n3. The attackers can flood the website directly or via other nodes (DDoS).\n4. The attacker can also sabotage the link between a client and webserver.\n5. The attack can come from outside or from within the cloud infrastructure.\nA solution needs to be built by suitably designing the cloud architecture and developing some tool (s) to automatically detect and recover from the DDoS attack.\n\nExpected Solution:\nA set of developed tool(s) along with a suitable Cloud architecture to be demonstrated. The demonstrated website should be protected well against different types of DDoS attack. In case of an attack, the developed security tools\nshould be able to automatically detect and protect a website hosted on cloud infrastructure against DDoS attacks. The solution should also demonstrate the automatic recovery from the attack. As high availability is an essential feature, the down time (recovery time) should be minimized to the extent possible.OrganizationMinistry of DefenceDepartmentDefence Research and Devlopment Organisation (DRDO)CategorySoftwareThemeBlockchain & CybersecurityYoutube LinkDataset LinkContact info"
    ]
  },
  "disaster_management": {
    "count": 9,
    "organizations": [
      "Madhya Pradesh Police",
      "Ministry of Defence",
      "Ministry of Coal",
      "Ministry of Social Justice and Empowerment",
      "Bharat Electronics Limited (BEL)",
      "Ministry of Power",
      "Ministry of Jal Shakti",
      "The National Disaster Response Force (NDRF), MHA"
    ],
    "sample_problems": [
      "Enhancing body detection in CSSR Operations Using Advanced Technology×Problem Statement DetailsProblem Statement ID1566Problem Statement TitleEnhancing body detection in CSSR Operations Using Advanced TechnologyDescriptionBackground: During CSSR (Collapsed Structure Search and Rescue) operations, NDRF teams encounter challenges in identifying buried deceased bodies amidst rubble and debris. Traditional search methods are often time-consuming and labor-intensive, hampering the timely recovery of victims and increasing the risk of further casualties.\nDescription: THe problem statement envisions the need for innovative technology to improve the detection and identification of buried deceased bodies during CSSR operations. Current methods such as manual probing, canine search, and acoustic sensing have limitations in accurately locating victims, especially in complex and hazardous environments.\nExpected Solution: An advanced technology solutions leveraging hardware and software innovations is required to enhance deceased body detection capabilities. This solution could involve the development of specialized sensors, imaging devices, or drones equipped with thermal imaging and ground-penetrating radar (GPR) technology. These tools would enable NDRF teams to scan debris piles and collapsed structures more efffectively, identifying buried bodies with greater accuracy and efficiency.OrganizationThe National Disaster Response Force (NDRF), MHADepartmentNational disaster response force (NDRF)CategoryHardwareThemeDisaster ManagementYoutube LinkDataset LinkContact info",
      "Design/Development of an efficient Energy Storage System (ESS) to integrate intermittent Renewable Energy sources and to support/stabilize the grid.×Problem Statement DetailsProblem Statement ID1572Problem Statement TitleDesign/Development of an efficient Energy Storage System (ESS) to integrate intermittent Renewable Energy sources and to support/stabilize the grid.DescriptionBackground:\nThe increasing adoption of renewable energy sources like solar and wind presents significant challenges due to their intermittent nature. This variability can strain the power grid, leading to inefficiencies and reliability issues. Traditional grid infrastructure is not designed to handle these fluctuations effectively, resulting in energy wastage and a reliance on fossil fuel-based backup power. Energy storage systems (ESS) offer a potential solution by storing excess energy generated during peak production periods and releasing it during times of high demand or low generation, ensuring a stable and reliable power supply.\n\nDescription:\nThe task is to design an innovative and efficient energy storage system to integrate intermittent renewable energy sources and stabilize the grid. This requires addressing several key challenges: high costs, technological limitations, and regulatory barriers. Current ESS technologies, such as lithium-ion batteries, pumped hydro storage, and flow batteries, each have their own strengths and weaknesses. Innovative ideas need to be explored to reduce costs, enhance storage capacities, and improve the efficiency and lifespan of these technologies. Additionally, how to navigate and potentially reform regulatory frameworks to support the widespread adoption of ESS may also be explored.\n\nExpected Solution:\nDevelop approaches to lower the initial and operational costs of ESS, potentially through new materials, manufacturing processes, or economies of scale. Identify or create advanced ESS technologies that offer higher efficiency, greater storage capacity, and longer operational lifespans. Suggest changes to policies and regulations that facilitate ESS integration, including safety standards, performance metrics, and grid interconnection protocols. Formulate strategies to engage key stakeholders, including policymakers, utility companies, and consumers, to build support for ESS deployment. Design small-scale pilot projects to test and refine their proposed solutions in real-world settings, gathering data to demonstrate effectiveness and scalability.OrganizationMinistry of PowerDepartmentMinistry of PowerCategoryHardwareThemeRenewable / Sustainable EnergyYoutube LinkDataset LinkContact info",
      "Video call intercom based on analog/IP system with vibration sensor×Problem Statement DetailsProblem Statement ID1578Problem Statement TitleVideo call intercom based on analog/IP system with vibration sensorDescriptionBackground: \n\nNeeds an internal communication including Deaf people. Maybe one wants to be able to communicate with one desk to another desk in office premises. Or in a case one upstairs in a bedroom doing some work and wants to know when dinner will be ready. Maybe the person is too weak to get up and shout down the stairs to find out if so, then this simple intercom will help him or her to get the information he or she needs. Deaf people are not able to hear and don't use oral language, they can see and communicate in Sign language and Sign language is a Visual language. So video call communication devices will be more accessible for the Deaf. Vibration sensors also will be help out in emergency to forward the information. It works without any charges like the telephones.\n\nDescription: In an office, business organization, Shops, stores and stressful in relating/delivering information to each other within a particular building. The servants find it laborious going to the boss always whenever he/she has information to deliver or wants to carry action with respect to the master├ö├ç├ûs authority. Therefore, this project work is to address this issue, looking forward to eliminating the stressful, manpower (Deaf) involved and to facilitate information delivery, making communication easier. The Intercom system formed the basis of this study and designed the HOD├ö├ç├ûs office and staff├ö├ç├ûs office for internal communication keeping the view of Deaf.OrganizationMinistry of Social Justice and EmpowermentDepartmentIndian Sign Language Research and Training Centre (ISLRTC)CategoryHardwareThemeMiscellaneousYoutube LinkDataset LinkContact info"
    ]
  },
  "transportation": {
    "count": 18,
    "organizations": [
      "Indo-Tibetan Border Police (ITBP), MHA",
      "Ministry of Earth Sciences",
      "Department of Science and Technology",
      "Ministry of Railway",
      "Ministry of Skill Development and Entrepreneurship (MSDE)",
      "Ministry of Power",
      "Ministry of Communication",
      "Ministry of Jal Shakti",
      "Ministry of Law and Justice",
      "Indian Space Research Organization (ISRO)",
      "Government of NCT of Delhi",
      "Ministry of Housing and Urban Affairs"
    ],
    "sample_problems": [
      "GOBARdhan - Simple control systems and/or instrumentation for small biogas plants that will allow better process control leading to effective digestion and improved yield of biogas.×Problem Statement DetailsProblem Statement ID1568Problem Statement TitleGOBARdhan - Simple control systems and/or instrumentation for small biogas plants that will allow better process control leading to effective digestion and improved yield of biogas.DescriptionBackground and Description: In Bio slurry production at village level, we witnessed few challenges and issues accociated with handling, utilization and some common issues with bio-slurry are Pathogen Contamination Accumulation, Anaerobic, Conditions, Transport and Storage. Expected Solution: a. Simple control systems and/or instrumentation for small biogas plants that will allow better process control leading to effective digestion and improved yield of biogas b. Low-cost kits to measure nutrient content of F/L OM c. Low-Cost enrichment models for F/L OM (Fermented/Liquid Organic Manure)OrganizationMinistry of Jal ShaktiDepartmentDepartment of Drinking Water and Sanitation (DDWS)CategoryHardwareThemeClean & Green TechnologyYoutube LinkDataset LinkContact info",
      "Build a detailed concept for an industrial scale green hydrogen (> 50 TPD) production facility, with a levelized cost of hydrogen (LCOH) below $2 USD per kg.×Problem Statement DetailsProblem Statement ID1574Problem Statement TitleBuild a detailed concept for an industrial scale green hydrogen (> 50 TPD) production facility, with a levelized cost of hydrogen (LCOH) below $2 USD per kg.DescriptionBackground:\nGreen hydrogen, produced from renewable energy sources, offers a game-changing solution for decarbonization. Unlike its fossil fuel counterpart, green hydrogen emits no greenhouse gasses at the point of use, making it ideal for hard-to-electrify sectors like heavy industry, long-distance transport, and steel production. This clean fuel can power vehicles and industrial processes, slashing emissions and combating climate change. Furthermore, green hydrogen's potential for energy storage allows for a more balanced and resilient renewable energy grid. As we strive for a net-zero future, green hydrogen is a crucial tool for a cleaner and more sustainable tomorrow.\n\nDescription:\nGreen hydrogen's potential for clean energy is undeniable. However, its widespread adoption faces a significant roadblock: high levelized cost. This cost, encompassing production, storage, and transportation, makes green hydrogen less competitive compared to traditional fossil fuels. This disparity discourages industries from switching to green alternatives. Government incentives, technological advancements, and economies of scale are all crucial to bridge this cost gap. Only then can green hydrogen fulfil its promise as a transformative force in the fight against climate change.\n\nExpected Solution:\nThe Project details should include definitive inputs on:\nSizing of production capacity.\nProduction technology, useful life, replacement costs etc.\nProposed RTC-RE model (if production is through electrolysers).\nProposed sourcing of Feedstock\nExpected plant CUF.\nEntire Financial Model with detailed breakup for CAPEX & OPEX.\nStorage technologies used (with compliance of safety standards) and their cost.\nApproaches used to lower levelized cost during project modelling.\nPolicy and Regulatory support required.\nScope for further cost optimisation through economies of scale.OrganizationMinistry of PowerDepartmentMinistry of PowerCategoryHardwareThemeClean & Green TechnologyYoutube LinkDataset LinkContact info",
      "Al based acoustic wave monitoring of rail defects like cracks, fracture and prediction for rail wear, quality along with other parameter.×Problem Statement DetailsProblem Statement ID1584Problem Statement TitleAl based acoustic wave monitoring of rail defects like cracks, fracture and prediction for rail wear, quality along with other parameter.DescriptionBackground: Rails are used for the movement of trains and if there are major defects in the track then accident may happen or riding comfort in train may be compromised. Rail defects such as cracks, fractures, and wear are critical issues in the railway industry, leading to safety hazards, operational disruptions, and increased maintenance costs. Early detection and prediction of these defects are essential for ensuring the reliability and safety of railway infrastructure. These defects are to be noticed while train is moving.\nDescription: The problem statement aims to develop an Al-based acoustic wave monitoring system for the early detection of rail defects and prediction of wear and quality parameters. The system will utilize acoustic waves to transmit to the rail tracks and its pattern will be monitored. The system will be capable of distinguishing between normal operating conditions and the presence of defects or abnormal wear patterns.\nExpected Solution: The proposed solution will involve the development of a comprehensive acoustic wave monitoring system for railway tracks. This system will consist of transmission side and reception side. Reception side sensors would be capable of predicting the track structure, quality of the rail and distance from a central fixed point.OrganizationMinistry of Housing and Urban AffairsDepartmentSmart Cities MissionCategoryHardwareThemeTransportation & LogisticsYoutube LinkDataset LinkContact info"
    ]
  },
  "women_child": {
    "count": 2,
    "organizations": [
      "Bharat Electronics Limited (BEL)",
      "Ministry of Law and Justice"
    ],
    "sample_problems": [
      "Women Safety Analytics ├ö├ç├┤ Protecting Women from safety threats×Problem Statement DetailsProblem Statement ID1605Problem Statement TitleWomen Safety Analytics ├ö├ç├┤ Protecting Women from safety threatsDescriptionBackground: The growing concern for the safety of women and the increase in crimes against women in various cities, highlight the need for advanced surveillance and analytical solutions to protect women from various possible threats. We need a promising approach to address these issues through real-time threat detection software.\nDetailed Description:\nBy leveraging advanced analytics through real-time monitoring, Women Safety Analytics should create safer environments for women and assist law enforcement in effectively addressing and preventing crimes against women. The proactive approach of detecting anomalies and generating alerts can play a crucial role in enhancing public safety and fostering a secure atmosphere for women.\nWomen safety analytics software should continuously monitor the scene to count the number of men and women present, offering insights into gender distribution in specific locations and times. It should identify unusual patterns, such as a lone woman at night, unusual gestures and generates alerts to pre-empt potential incidents.\nAdvantages of the system:\n? By providing real-time monitoring and alerts, the system helps to create a safer environment for women.\n? Early detection enables law enforcement to intervene before situations escalate.\n? Continuous analysis provides valuable data to identify hotspots and trends, aiding in strategic planning for city safety\nExpected Solution:\nWomen safety analytics should include the following functionalities\n1. Person detection along with Gender Classification\n2. Gender Distribution : Count the number of men and women present in the scene\n3. Identifying a Lone Woman at Night time\n4. Detection of a Woman Surrounded by Men\n5. Recognizing SOS situation through gesture analytics\n6. Identifying hotspots where incidents are more likely to occur, based on the past alertsOrganizationBharat Electronics Limited (BEL)DepartmentBharat Electronics Limited (BEL)CategorySoftwareThemeMiscellaneousYoutube LinkDataset LinkContact info",
      "Bail Reckoner×Problem Statement DetailsProblem Statement ID1702Problem Statement TitleBail ReckonerDescriptionObjective\nThe objective is to develop an innovative digital solution, termed the \"Bail Reckoner,\" designed to assist undertrial prisoners, legal aid providers, and judicial authorities in streamlining the bail process. The Bail Reckoner aims to simplify and expedite the bail application and evaluation process by considering various legal and procedural parameters.\nParameters to Consider for integration in the Tool:\n1. Nature of the Offense and Penal Provisions:\no Seek the inputs for the charges framed (can be multiple charges, and if they are compoundable etc). In this regard Statutes like Indian Penal Code,1860 and the upcoming Bhartiya Nyaya Sanhita 2023; Bhartiya Suraksha Sanhita 2023; and Bhartiya Saakshya Adhiniyam 2023; should be covered. Special statutes on the following under-mentioned areas should also be covered:\n1. Cyber Crimes\n2. Crimes Against SCs and STs:\n3. Crimes Against Women\n4. Crimes Against Children\n5. Offences Against the State\n6. Economic Offence\n7. Crimes Against Foreigners\na. Develop a comprehensive backend database to map penalties with sections of various Acts/Laws.\nb. Link and provide detailed information on the nature of offenses and corresponding legal provisions.\n2. Duration of Imprisonment Already Served:\na. Track the duration of imprisonment undertrial prisoner has served.\nb. Highlight the eligibility timeline for bail based on the time already served.\n3. Considerations of Judge├ö├ç├ûs Discretion:\na. Evaluate the risk of the undertrial prisoner escaping the judicial process, such as leaving the country.\nb. Assess the potential influence the prisoner may have on evidence or witnesses.\n4. Procedural Pre-requisites:\na. Outline requirements such as surety bonds, personal bonds, fines (if applicable), and identity verification.\nb. Ensure compliance with procedural aspects under IPC/CrPC.\n5. Judicial Pronouncements on Bail Eligibility:\na. Integrate key judicial pronouncements regarding bail eligibility.\nb. Automatically identify undertrial prisoners who are eligible for bail if they have served half the term during the undertrial stage, based on the prescribed sentence for their charges.\nSolution Requirements\n. The Bail Reckoner should be a user-friendly, plug-and-play tool that can be integrated into existing software systems. It must provide a clear and accessible interface for:\n1. Undertrial Prisoners: To understand their eligibility and process for applying for bail.\n2. Legal Aid Providers: To assist in preparing and submitting accurate bail applications.\n3. Judicial Authorities: To streamline the evaluation process and ensure timely decisions.\nBy leveraging technology and innovation, the Bail Reckoner aims to make the bail process more transparent, efficient, and just, contributing to a more equitable legal system.OrganizationMinistry of Law and JusticeDepartmentMinistry of Law and JusticeCategorySoftwareThemeSmart AutomationYoutube LinkDataset LinkContact info"
    ]
  },
  "governance": {
    "count": 9,
    "organizations": [
      "Ministry of Communication",
      "Ministry of Housing and Urban Affairs",
      "Indian Space Research Organization (ISRO)",
      "Government of NCT of Delhi"
    ],
    "sample_problems": [
      "Online monitoring of Unauthorized construction across the city×Problem Statement DetailsProblem Statement ID1618Problem Statement TitleOnline monitoring of Unauthorized construction across the cityDescriptionMCD is working on monitoring of unauthorized construction across th ecity. A viable and low cost solution is required e.g. Drone based surveys of swathes of land/areas as per defined time intervals will help real-time detection of unauthorized constructionOrganizationGovernment of NCT of DelhiDepartmentIT Department, GNCTDCategorySoftwareThemeRobotics and DronesYoutube LinkDataset LinkContact info",
      "Online real-time survey and monitoring of water bodies in Delhi×Problem Statement DetailsProblem Statement ID1619Problem Statement TitleOnline real-time survey and monitoring of water bodies in DelhiDescriptionTechnological solution for real-time survey and monitoring of water bodies in Delhi is one of the critical areas for rejuvenation of these water bodiesOrganizationGovernment of NCT of DelhiDepartmentIT Department, GNCTDCategorySoftwareThemeMiscellaneousYoutube LinkDataset LinkContact info",
      "Online issuance of Caste and other certificates by Revenue Department need real-time monitoring×Problem Statement DetailsProblem Statement ID1622Problem Statement TitleOnline issuance of Caste and other certificates by Revenue Department need real-time monitoringDescriptionThe issuance of Caste and other certificates by Revenue Department need real-time monitoring to evaluate the resource allocation and demand for such certificates. The allocation of resources at present is done without any analysis leading to huge backlogs in some Sub-divison where the application load is very high. Any effective monitoring at District and Central level with detailed evaluation shall enable providing better allocation of resources for issuanc of such certificatesOrganizationGovernment of NCT of DelhiDepartmentIT Department, GNCTDCategorySoftwareThemeSmart AutomationYoutube LinkDataset LinkContact info"
    ]
  },
  "tourism": {
    "count": 3,
    "organizations": [
      "Ministry of Earth Sciences",
      "Ministry of Culture",
      "National Technical Research Organisation (NTRO)"
    ],
    "sample_problems": [
      "Online Chatbot based ticketing system×Problem Statement DetailsProblem Statement ID1648Problem Statement TitleOnline Chatbot based ticketing systemDescriptionBackground:\nVisitors to museums often face several significant challenges due to manual ticket booking systems. One prominent issue is the inefficiency and time consumption associated with the process. Long queues are common, especially during peak hours, weekends, or special exhibitions, leading to frustration and impatience among visitors. Besides the wait times, the manual system is prone to errors, such as incorrect ticket issuance, double bookings, or lost records, which can cause further delays and inconvenience. Overall, these challenges associated with manual ticket booking systems significantly detract from the visitor experience, reducing satisfaction and potentially impacting the museum's reputation and visitor numbers.\nDescription:\nThe implementation of a chatbot for ticket booking in a museum addresses several critical needs, enhancing the overall visitor experience and streamlining museum operations. Here are the key reasons for adopting a chatbot ticket booking system:\n1. Improved Customer Service\n2. Efficient Handling of High Volumes\n3. Cost-Effective Solution\n4. Data Collection and Analysis\n5. Accessibility\n6. Reduced Human Error\n7. Multilingual Support\n8. Enhanced Marketing and Promotion\nExpected Solution:\nAn efficient and responsive multilingual chatbot based ticketing system that can handle all kinds of bookings from gate entry to shows. Payment gateway should also be integrated to make it fully free from human intervention. It will also provide analytics to aid in more efficient decision making process.OrganizationMinistry of CultureDepartmentNational Council of Science MuseumsCategorySoftwareThemeTravel & TourismYoutube LinkDataset LinkContact info",
      "Development of a mobile application to provide recreational suitability information of beach locations across India.×Problem Statement DetailsProblem Statement ID1656Problem Statement TitleDevelopment of a mobile application to provide recreational suitability information of beach locations across India.DescriptionBackground: Coastal tourism is one of the priority areas highlighted in the Draft Blue economy policy of India. As such, use of technology to improve the tourism and related sectors is the need of the hour. Given the expected increase in the coastal tourism of our country, there is a need to ensure safety of the tourists. In this regard, a mobile application indicating the suitability of beaches for recreational activities (based on the current ocean state like wave heights/ocean currents, meteorological parameters like wind, water quality etc.) will be a useful value addition to the coastal tourism sector.\nDescription: The proposed app should be able to provide tourism suitability (say suitable/not suitable based on various parameters) at a particular point of time across various beaches in India.\nCreate locations of different beaches across the country.\nDifferent parameters to be considered to determine suitability of a coastal location for recreation activities like Ocean alerts (High Wave/Swell Surge/Ocean Currents/Storm Surge/Tsunami), Winds, Water quality assessments. These parameters will be available via INCOIS (Indian National Centre for Ocean Information Services) API.\nThe application should devise a method/algorithm to use the above parameters and make the safety/suitability decision at the different locations.\nVisualization using geospatial maps and colour codes based on suitability of locations.\nBased on the current location of the user, alert notifications to be provided in case of any alerts in the coastal location of the user) to be provided\nExpected Solution:\nDesign and development of a mobile application which identifies suitability of coastal tourism sites based on the current weather and oceanic conditions.\nThis can help to save lives and better plan the coastal tourist/recreational activities for the user.OrganizationMinistry of Earth SciencesDepartmentIndian National Center for Ocean Information Services (INCOIS)CategorySoftwareThemeTravel & TourismYoutube LinkDataset LinkThe oceanic alerts information will be available via REST API. Water quality assessment is available from https://incois.gov.in/portal/wqns/water_quality.jspContact info",
      "Centralized Automated Solution for Price Estimation & Reasonability.×Problem Statement DetailsProblem Statement ID1682Problem Statement TitleCentralized Automated Solution for Price Estimation & Reasonability.Description2.1 Background:\n2.1.1 Procurement is an essential component of any project. There are set rules and procedures to undertake various kinds of procurements. Each procurement methodology has several milestones, which too need careful planning and execution, to avoid time and cost over runs.\n2.1.2 As such, Government procurements are driven by the General Financial Rules (GFRs) and the Manuals for Procurement of Goods and of Services. Needless to say, all procurements are made keeping in mind transparency, fair competition amongst vendors as well as cost reasonability for the product services, as public money is involved.\n2.1.3 One of the important methodologies often employed in procurement processes is establishing the ├ö├ç├┐price reasonability├ö├ç├û for a certain product/service. This methodology is generally applied at two stages, viz. while obtaining administrative approval for procuring the said product/service, and before opening the commercial bids of qualified vendors.\n2.1.4 The process of ascertaining the price reasonability of any product/service of interest is commonly known as Price Benchmarking.\n2.2 Detailed Description:\n2.2.1 There are various strategies to benchmark the cost. Some of them are as follows:\ni. Sometimes, the cost of the product or the rate at which service is to be hired are already defined by the Government. For example, labor rates.\nii. It may be possible that a similar product/service has been procured by the department in recent past. This can be taken as reference, known as the Last Purchase Price.\niii. When none of the above is known, the most prevalent technique to gather information about the approximate value of the product/service is Market Survey.\n2.2.2 Market Survey may be carried out physically by a team, as the name suggests, by actually visiting the market. However, this practice is only feasible for common goods/services such as stationery, common electrical appliances (AC, Fan, Lights etc), common services (sanitation, horticulture, maintenance etc). In case of sophisticated systems like Networking Solutions, Communication Systems, Sensors, Payloads and other Electronic Systems, this method does not work. In such cases, the market survey is carried out from information available in public domain.\n2.2.3 This presents a complex problem. Information about prices of items which are used in abundancy by various departments (e.g. routers, switches, Hard Disk Drives, Laptops, Workstations, Graphics Cards etc), are available in the public domain, generally speaking. On the other hand, Information about prices of not so common items (e.g. Microwave Devices, Waveguides, Transmission Lines, Antennae, HF/VHF equipment, Software Defined Radios, etc) may or may not be available, resulting in a hit- and-trial approach).\n\n2.2.4 Therefore a web-based application, which can assist various teams to tabulate the approximate price of products/services from various sources from information available in public domain, would be very useful. The contours of such an application is explained in subsequent paragraphs.\n2.3 Expected Solution:\n2.3.1 The solution will be web based. Users will first register themselves and thereafter use it, through their login credentials. The application interface will be simple without unnecessary graphics and multimedia for quick loading and fast responsiveness.\n2.3.2 The users can query the applications either by providing the exact make/model or the most relevant specifications in case of Products, or by providing general information in case of Services.\n2.3.3 Based on the inputs provided by the user, the application will use an appropriate method to crawl the web and gather information, which will then be presented to the user. The minimum input fields and the expected output fields are explained below, for various scenarios.\n(Drive link for further explanation of the expected solution : https://drive.google.com/file/d/1oAwvekZ54TZpntQUnGdVF6gBvGk_NbIu/view?usp=sharing)OrganizationNational Technical Research Organisation (NTRO)DepartmentNational Technical Research Organisation (NTRO)CategorySoftwareThemeSmart AutomationYoutube LinkDataset LinkContact info"
    ]
  },
  "fintech": {
    "count": 1,
    "organizations": [
      "Ministry of Jal Shakti"
    ],
    "sample_problems": [
      "Development of handheld device/Mobile based Operation & Maintenance tool for asset & consumables inventories and finance management in context of drinking water supply scheme.×Problem Statement DetailsProblem Statement ID1688Problem Statement TitleDevelopment of handheld device/Mobile based Operation & Maintenance tool for asset & consumables inventories and finance management in context of drinking water supply scheme.DescriptionBackground: The Jal Jeevan Mission (JJM) is a flagship initiative of the Government of India aimed at ensuring safe and sustainable drinking water to all rural households in the country.\nDevelop a handheld device/Mobile based application designed to support the operation and maintenance (O&M) of drinking water supply schemes. This tool will assist the GP/PHED person to manage assets and consumable inventories, as well as finance-related tasks, enhancing the efficiency and effectiveness of water supply operations. This tool would also have capabilities of bill generation & payment interface such as UPI, Net Banking, Credit cards etc. The panchayat should be able to operate and procure the tool. The tool should enable panchayat to manage in village infrastructure.\nExpected Solution: \na)The tool should record on GIS all assets related to the water supply infrastructure, such as pumps, pipelines, valves, and treatment plants along with attributes.\nb) It should store detailed information about each asset, including location, installation date, and other historical data.\nc) Manage inventories of consumables like chemicals, filters, spare parts, and other supplies and forecast demand and plan for replenishment.\nd) It should be able to record receipts from various sources credited to a/c of GP.\ne) Record expenditure for activities, repairs, replacements and consumable purchases.\nf) Manage consumer list, generate bills, prepare cash book for GP.\ng) User friendly and easy to use for GP level operation.\nh) Local language may be provided\ni) The payment gateway may be integrated\nj) Provision of online UPI payment may be provided\nk) It should have payment interface & bill provisioning.OrganizationMinistry of Jal ShaktiDepartmentDepartment of Drinking Water and Sanitation (DDWS)CategorySoftwareThemeSmart AutomationYoutube LinkDataset LinkContact info"
    ]
  }
}